budget/Documents/Операция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Операция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФактБюджета</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенег</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Счета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

budget/AccumulationRegisters/ФактБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ФактБюджета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

budget/AccumulationRegisters/ОстаткиДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенег</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

budget/Enums/ДоходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДоходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

budget/Documents/Операция/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
		
	// регистр ФактБюджета 
	Движения.ФактБюджета.Очистить();	
	Движения.ФактБюджета.Записывать = Истина;
	Для Каждого ТекСтрокаОперации Из Операции Цикл
		Движение = Движения.ФактБюджета.Добавить();
		Движение.Период = Дата;
		Движение.Месяц = НачалоМесяца(Дата);
		Движение.Статья = ТекСтрокаОперации.Статья;
		Движение.СуммаФакт = ТекСтрокаОперации.Сумма;
	КонецЦикла;
	
	
	     //регистр ОстаткиДенег 
	Движения.ОстаткиДенег.Очистить();
	
	//запись ссылок на статьи в массив
	МассивСтатей = Новый Массив;
	Для Каждого ТекСтрокаОперации Из Операции Цикл
		МассивСтатей.Добавить(ТекСтрокаОперации.Статья);
	КонецЦикла;  
	
	//запись соответсвия ключ-ссылка на статью, значение-ключ
	СоответствиеТипа = Новый Соответствие;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	СтатьиБюджета.Тип КАК Тип, 
					|	СтатьиБюджета.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.СтатьиБюджета КАК СтатьиБюджета
					|ГДЕ
					|	СтатьиБюджета.Ссылка В(&МассивСтатей)"; 
	
	Запрос.УстановитьПараметр("МассивСтатей", МассивСтатей); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		СоответствиеТипа.Вставить(Выборка.Ссылка, Выборка.Тип);
	КонецЦикла; 
	
	//запись движений
	Движения.ОстаткиДенег.Записывать = Истина; 
	
	Для каждого ТекСтрокаОперации Из Операции Цикл
		Движение = Движения.ОстаткиДенег.Добавить();
		ТипОперации = СоответствиеТипа.Получить(ТекСтрокаОперации.Статья);
		
		Если НЕ ТипОперации = Неопределено Тогда
			
			Если ТипОперации = Перечисления.ДоходРасход.Доход Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе 	 
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;	
			
			Движение.Период = Дата;
			Движение.Счет = ТекСтрокаОперации.Счет;
			Движение.Сумма = ТекСтрокаОперации.Сумма;

		КонецЕсли;
	
	КонецЦикла;
		 
КонецПроцедуры	
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ТЧ = ЭтотОбъект.Операции;
	Отказ = ПроверкаНаПустуюТЧ(ТЧ);
	
КонецПроцедуры
